
#అన్తర్భావ "common_rc.h"

__EXPORT rc_decode_buf_t rc_decode_buf;

uint8_t crc8_dvb_s2(uint8_t చక్రీయ_తనిఖీ, uint8_t a)
{
	చక్రీయ_తనిఖీ ^= a;

	కొరకు (పూర్ణాంకం i = 0; i < 8; ++i) {
		ఒకవేళ (చక్రీయ_తనిఖీ & 0x80) {
			చక్రీయ_తనిఖీ = (చక్రీయ_తనిఖీ << 1) ^ 0xD5;

		} లేకపోతే {
			చక్రీయ_తనిఖీ = చక్రీయ_తనిఖీ << 1;
		}
	}

	తిరిగి చక్రీయ_తనిఖీ;
}

uint8_t crc8_dvb_s2_buf(uint8_t *buf, పూర్ణాంకం len)
{
	uint8_t చక్రీయ_తనిఖీ = 0;

	కొరకు (పూర్ణాంకం i = 0; i < len; ++i) {
		చక్రీయ_తనిఖీ = crc8_dvb_s2(చక్రీయ_తనిఖీ, buf[i]);
	}

	తిరిగి చక్రీయ_తనిఖీ;
}
