
#ضمن "common_rc.h"

__EXPORT rc_decode_buf_t rc_decode_buf;

uint8_t crc8_dvb_s2(uint8_t بررسی_چرخهای, uint8_t a)
{
	بررسی_چرخهای ^= a;

	لكل (صحيح i = 0; i < 8; ++i) {
		إذا (بررسی_چرخهای & 0x80) {
			بررسی_چرخهای = (بررسی_چرخهای << 1) ^ 0xD5;

		} وإلا {
			بررسی_چرخهای = بررسی_چرخهای << 1;
		}
	}

	أرجع بررسی_چرخهای;
}

uint8_t crc8_dvb_s2_buf(uint8_t *buf, صحيح len)
{
	uint8_t بررسی_چرخهای = 0;

	لكل (صحيح i = 0; i < len; ++i) {
		بررسی_چرخهای = crc8_dvb_s2(بررسی_چرخهای, buf[i]);
	}

	أرجع بررسی_چرخهای;
}
