
#ضمن "common_rc.h"

__EXPORT rc_decode_buf_t rc_decode_buf;

uint8_t crc8_dvb_s2(uint8_t دوراني_ازموینه, uint8_t a)
{
	دوراني_ازموینه ^= a;

	لكل (صحيح i = 0; i < 8; ++i) {
		إذا (دوراني_ازموینه & 0x80) {
			دوراني_ازموینه = (دوراني_ازموینه << 1) ^ 0xD5;

		} وإلا {
			دوراني_ازموینه = دوراني_ازموینه << 1;
		}
	}

	أرجع دوراني_ازموینه;
}

uint8_t crc8_dvb_s2_buf(uint8_t *buf, صحيح len)
{
	uint8_t دوراني_ازموینه = 0;

	لكل (صحيح i = 0; i < len; ++i) {
		دوراني_ازموینه = crc8_dvb_s2(دوراني_ازموینه, buf[i]);
	}

	أرجع دوراني_ازموینه;
}
