
#ಅನ್ತರ್ಭಾವ "common_rc.h"

__EXPORT rc_decode_buf_t rc_decode_buf;

uint8_t crc8_dvb_s2(uint8_t ಚಕ್ರೀಯ_ಪರೀಕ್ಷೆ, uint8_t a)
{
	ಚಕ್ರೀಯ_ಪರೀಕ್ಷೆ ^= a;

	ಗಾಗಿ (ಪೂರ್ಣಾಂಕ i = 0; i < 8; ++i) {
		ಆದರೆ (ಚಕ್ರೀಯ_ಪರೀಕ್ಷೆ & 0x80) {
			ಚಕ್ರೀಯ_ಪರೀಕ್ಷೆ = (ಚಕ್ರೀಯ_ಪರೀಕ್ಷೆ << 1) ^ 0xD5;

		} ಇಲ್ಲದಿದ್ದರೆ {
			ಚಕ್ರೀಯ_ಪರೀಕ್ಷೆ = ಚಕ್ರೀಯ_ಪರೀಕ್ಷೆ << 1;
		}
	}

	ಹಿಂತಿರುಗಿ ಚಕ್ರೀಯ_ಪರೀಕ್ಷೆ;
}

uint8_t crc8_dvb_s2_buf(uint8_t *buf, ಪೂರ್ಣಾಂಕ len)
{
	uint8_t ಚಕ್ರೀಯ_ಪರೀಕ್ಷೆ = 0;

	ಗಾಗಿ (ಪೂರ್ಣಾಂಕ i = 0; i < len; ++i) {
		ಚಕ್ರೀಯ_ಪರೀಕ್ಷೆ = crc8_dvb_s2(ಚಕ್ರೀಯ_ಪರೀಕ್ಷೆ, buf[i]);
	}

	ಹಿಂತಿರುಗಿ ಚಕ್ರೀಯ_ಪರೀಕ್ಷೆ;
}
